[Killed] BlockStatement
src/operacoes.js:85:33
 function produtoArray(numeros) {
   return numeros.reduce((acc, val) => acc * val, 1);
 }
-function clamp(valor, min, max) {
-  // Stryker disable next-line EqualityOperator: valor === min retorna o mesmo resultado com < ou <=.
-  if (valor < min) return min;
-  // Stryker disable next-line EqualityOperator: valor === max retorna o mesmo resultado com > ou >=.
-  if (valor > max) return max;
-  return valor;
-}
+function clamp(valor, min, max) {}
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:87:7
 }
 function clamp(valor, min, max) {
   // Stryker disable next-line EqualityOperator: valor === min retorna o mesmo resultado com < ou <=.
-  if (valor < min) return min;
+  if (false) return min;
   // Stryker disable next-line EqualityOperator: valor === max retorna o mesmo resultado com > ou >=.
   if (valor > max) return max;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 54. deve validar clamp abaixo, acima e nas bordas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -5

[Killed] ConditionalExpression
src/operacoes.js:87:7
 }
 function clamp(valor, min, max) {
   // Stryker disable next-line EqualityOperator: valor === min retorna o mesmo resultado com < ou <=.
-  if (valor < min) return min;
+  if (true) return min;
   // Stryker disable next-line EqualityOperator: valor === max retorna o mesmo resultado com > ou >=.
   if (valor > max) return max;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/operacoes.js:89:7
   // Stryker disable next-line EqualityOperator: valor === min retorna o mesmo resultado com < ou <=.
   if (valor < min) return min;
   // Stryker disable next-line EqualityOperator: valor === max retorna o mesmo resultado com > ou >=.
-  if (valor > max) return max;
+  if (false) return max;
   return valor;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 54. deve validar clamp abaixo, acima e nas bordas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 15

[Killed] ConditionalExpression
src/operacoes.js:89:7
   // Stryker disable next-line EqualityOperator: valor === min retorna o mesmo resultado com < ou <=.
   if (valor < min) return min;
   // Stryker disable next-line EqualityOperator: valor === max retorna o mesmo resultado com > ou >=.
-  if (valor > max) return max;
+  if (true) return max;
   return valor;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10
